package 用数组模拟链表;/*
* 题目及评测链接:https://www.acwing.com/problem/content/828/
* 不许定义子类，用数组实现一个单链表，链表初始为空，支持三种操作：
(1) 向链表头插入一个数；
(2) 删除第k个插入的数后面的数；
(3) 在第k个插入的数后插入一个数
现在要对该链表进行M次操作，进行完所有操作后，从头到尾输出整个链表。
注意:题目中第k个插入的数并不是指当前链表的第k个数。例如操作过程中一共插入了n个数，则按照插入的时间顺序，这n个数依次为：第1个插入的数，第2个插入的数，…第n个插入的数。
输入格式
第一行包含整数M，表示操作次数。
接下来M行，每行包含一个操作命令，操作命令可能为以下几种：
(1) “H x”，表示向链表头插入一个数x。
(2) “D k”，表示删除第k个输入的数后面的数（当k为0时，表示删除头结点）。
(3) “I k x”，表示在第k个输入的数后面插入一个数x（此操作中k均大于0）。
输出格式
共一行，将整个链表从头到尾输出。
数据范围
1≤M≤100000
所有操作保证合法。
输入样例：
10
H 9
I 1 1
D 1
D 0
H 6
I 3 6
I 4 5
I 4 5
I 3 4
D 6
输出样例：
6 4 6 5
* */

public class 用数组模拟单链表 {
    int N = 100010;
    int[] e = new int[N];//保存节点值
    int[] ne = new int[N];//保存节点的下个节点下标
    int head = -1;
    int idx = 0;//未使用下标标识

    //新增一个值为val的节点
    void add_head(int val){
        e[idx] = val;//在新的位置上保存节点值
        ne[idx] = head;//将新节点的next指针指向头节点next指针
        head = idx;//将头节点指向新节点
        idx++;//未使用下标后移一位
    }
}
